#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УслугиДОППоДетямСрезПоследних.Ребенок КАК Ребенок,
		|	УслугиДОППоДетямСрезПоследних.Услуга КАК Услуга,
		|	УслугиДОППоДетямСрезПоследних.Операция КАК Операция,
		|	УслугиДОППоДетямСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ ВТ_ВсеПериоды
		|ИЗ
		|	РегистрСведений.УслугиДОППоДетям.СрезПоследних(&ДатаОтчисления, Ребенок В (&СписокДетей)) КАК УслугиДОППоДетямСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеПериоды.Ребенок КАК Ребенок,
		|	ВТ_ВсеПериоды.Услуга КАК Услуга,
		|	МАКСИМУМ(ВТ_ВсеПериоды.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ПериодМакс
		|ИЗ
		|	ВТ_ВсеПериоды КАК ВТ_ВсеПериоды
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеПериоды.Ребенок,
		|	ВТ_ВсеПериоды.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПериодМакс.Ребенок КАК Ребенок,
		|	ВТ_ПериодМакс.Услуга КАК Услуга,
		|	ВТ_ПериодМакс.Период КАК Период,
		|	ВТ_ВсеПериоды.Операция КАК Операция
		|ПОМЕСТИТЬ ВТ_ПоследниеОперации
		|ИЗ
		|	ВТ_ПериодМакс КАК ВТ_ПериодМакс
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеПериоды КАК ВТ_ВсеПериоды
		|		ПО (ВТ_ВсеПериоды.Ребенок = ВТ_ПериодМакс.Ребенок)
		|			И (ВТ_ВсеПериоды.Услуга = ВТ_ПериодМакс.Услуга)
		|			И (ВТ_ВсеПериоды.Период = ВТ_ПериодМакс.Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПоследниеОперации.Ребенок КАК Ребенок,
		|	ВТ_ПоследниеОперации.Услуга КАК Услуга,
		|	&ДатаОтчисления КАК Период,
		|	&ДатаОтчисления КАК ДатаЗачисленияОтчисления,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииУслуг.Отчисление) КАК Операция
		|ИЗ
		|	ВТ_ПоследниеОперации КАК ВТ_ПоследниеОперации
		|ГДЕ
		|	ВТ_ПоследниеОперации.Операция = ЗНАЧЕНИЕ(Перечисление.ОперацииУслуг.Зачисление)";
	
	МассивСписокДетей = СписокДетей.ВыгрузитьКолонку("ФИОРебенка");
	Запрос.УстановитьПараметр("ДатаОтчисления", ДатаОтчисления);
	Запрос.УстановитьПараметр("СписокДетей",    МассивСписокДетей);
	РезультатЗапроса = Запрос.Выполнить();	
	Движения.УслугиДОППоДетям.Записывать = Истина; 
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 	
		Движение = Движения.УслугиДОППоДетям.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка); 		
	КонецЦикла;	
КонецПроцедуры
#КонецОбласти
#КонецЕсли