&НаКлиенте
Процедура ПлатныеУслугиПериодРеализацииДОППриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПлатныеУслуги.ТекущиеДанные;
	Если НЕ ПустаяСтрока(СтрокаТЧ) Тогда
		СтрокаТЧ.КоличествоЗанятийВПериодРеализацииДОП = СтрокаТЧ.ПериодРеализацииДОП * СтрокаТЧ.КоличествоЗанятийВМесяц;
		СтрокаТЧ.ТарифЗаОдинМесяц = СтрокаТЧ.ПериодРеализацииДОП * СтрокаТЧ.ТарифЗаОдноЗанятие;
		СтрокаТЧ.ТарифЗаДОП = СтрокаТЧ.КоличествоЗанятийВМесяц * СтрокаТЧ.ПериодРеализацииДОП * СтрокаТЧ.ТарифЗаОдноЗанятие;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлатныеУслугиКоличествоЗанятийВМесяцПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПлатныеУслуги.ТекущиеДанные;
	Если НЕ ПустаяСтрока(СтрокаТЧ) Тогда
		СтрокаТЧ.КоличествоЗанятийВПериодРеализацииДОП = СтрокаТЧ.ПериодРеализацииДОП * СтрокаТЧ.КоличествоЗанятийВМесяц;
		СтрокаТЧ.ТарифЗаДОП = СтрокаТЧ.КоличествоЗанятийВМесяц * СтрокаТЧ.ПериодРеализацииДОП * СтрокаТЧ.ТарифЗаОдноЗанятие;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлатныеУслугиТарифЗаОдноЗанятиеПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ПлатныеУслуги.ТекущиеДанные;
	Если НЕ ПустаяСтрока(СтрокаТЧ) Тогда
		СтрокаТЧ.ТарифЗаОдинМесяц = СтрокаТЧ.ТарифЗаОдноЗанятие * СтрокаТЧ.КоличествоЗанятийВМесяц;
		СтрокаТЧ.ТарифЗаДОП = СтрокаТЧ.КоличествоЗанятийВМесяц * СтрокаТЧ.ПериодРеализацииДОП * СтрокаТЧ.ТарифЗаОдноЗанятие;
	КонецЕсли;
КонецПроцедуры

