#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЗатратыНаРебенкаВМесяц
	Движения.ЗатратыНаРебенкаВМесяц.Записывать = Истина;
	Для Каждого ТекСтрокаПлатныеУслуги Из ПлатныеУслуги Цикл
		Движение = Движения.ЗатратыНаРебенкаВМесяц.Добавить();
		Движение.Период = Дата;
		Движение.Услуга = ТекСтрокаПлатныеУслуги.Услуга;
		Движение.ЗатратыНаРебенкаВМесяц = ТекСтрокаПлатныеУслуги.ЗатратыНаРебенкаВМесяц;
		Движение.ДополнительнаяОбщеобразовательнаяПрограмма = ТекСтрокаПлатныеУслуги.Услуга.Владелец;
		Движение.ВозрастОбучающихся = ТекСтрокаПлатныеУслуги.Услуга.ВозрастОбучающихся;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#КонецЕсли

