#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр УслугиДОППоДетям
	Движения.УслугиДОППоДетям.Записывать = Истина;
	Движение = Движения.УслугиДОППоДетям.Добавить();
	Движение.Период = Дата;
	Движение.Ребенок = ФИОРебенка;
	Движение.Услуга = ПлатнаяУслуга;
	Движение.Операция = Перечисления.ОперацииУслуг.Отчисление;
	Движение.ДатаЗачисленияОтчисления = Дата;
КонецПроцедуры
#КонецОбласти
#КонецЕсли
