#Область Подсчеты
Процедура ПодсчетПустыхЗначений(СтрокаТЧ) Экспорт
    КоличествоПустыхЗначений = 0;  
    Для Н = 1 По 8 Цикл
        Если ПустаяСтрока(СтрокаТЧ["День" + Н]) Тогда
            КоличествоПустыхЗначений = КоличествоПустыхЗначений + 1;
        КонецЕсли;
    КонецЦикла;    
    СтрокаТЧ.Итого = КоличествоПустыхЗначений;
КонецПроцедуры

Процедура ПодсчетКоличестваДетодней(ТабличнаяЧасть, КоличествоДетодней) Экспорт
    КолДД = 0;
    Если ТабличнаяЧасть.Количество() > 0 Тогда
        Для Каждого Строка Из ТабличнаяЧасть Цикл
            Если Не ЗначениеЗаполнено(Строка.Итого) Тогда
                Продолжить;
            КонецЕсли;
            Если ТипЗнч(Строка.Итого) = Тип("Число") Или ТипЗнч(Строка.Итого) = Тип("Строка") Тогда
                КолДД = КолДД + Число(Строка.Итого);
            КонецЕсли;
        КонецЦикла;
        КоличествоДетодней = КолДД;
	Иначе
	    КоличествоДетодней = 0;
    КонецЕсли;
КонецПроцедуры
#КонецОбласти 

#Область Расчеты
Процедура РассчитатьСуммуКОплате(СтрокаТЧ, СтоимостьЗаЗанятие) Экспорт
	СуммаКОплате = СтоимостьЗаЗанятие * СтрокаТЧ.Итого;	
	СтрокаТЧ.СуммаКОплате = СуммаКОплате;
КонецПроцедуры

Процедура РассчитатьСуммуДоплаты(КоличествоДетодней, ЗатратыНаРебенка, СуммаДоплатыПреподавателю)Экспорт
	СуммаДоплаты = КоличествоДетодней * ЗатратыНаРебенка;
	СуммаДоплатыПреподавателю = СуммаДоплаты;
КонецПроцедуры
#КонецОбласти

   