
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	//НаимДОП = ЭтотОбъект.НаименованиеДОП;
	//РасчетСуммы.ПодсчетКоличестваДетодней(ЭтотОбъект.СписокПосещения, ЭтотОбъект.КоличествоДетодней);
	//ЗатратыНаРебенка = ПолучитьЗатратыНаРебенкаНаСервере(НаимДОП, ЭтотОбъект.Дата);
	//РасчетСуммы.РассчитатьСуммуДоплаты(ЭтотОбъект.КоличествоДетодней,ЗатратыНаРебенка, ЭтотОбъект.СуммаДоплатыПреподавателю);
	//СтоимостьЗаЗанятие = ПолучитьСтоимостьЗаЗанятиеНаСервере(НаимДОП, ЭтотОбъект.Дата);
	//Если ЭтотОбъект.СписокПосещения.Количество() > 0 Тогда
	//	// Для каждой строки табличной части
	//	Для Каждого Строка Из ЭтотОбъект.СписокПосещения Цикл
	//		РасчетСуммы.ПодсчетПустыхЗначений(Строка);
	//		РасчетСуммы.РассчитатьСуммуКОплате(Строка,СтоимостьЗаЗанятие);
	//	КонецЦикла;
	//Иначе
	//	Сообщение = Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru = 'Список посещения пуст.'");
	//	Сообщение.Сообщить();
	//КонецЕсли;
	
КонецПроцедуры
