#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	#Область ОбработчикиСобытий
	Процедура ОбработкаПроведения(Отказ, Режим)
		// регистр УслугиДОППоДетям
		Движения.УслугиДОППоДетям.Записывать = Истина;
		Для Каждого ТекСтрокаТабДок Из ТабДок Цикл
			Движение = Движения.УслугиДОППоДетям.Добавить();
			Движение.Период = Дата;
			Движение.Ребенок = ФИОРебенка;
			Движение.Услуга = ТекСтрокаТабДок.НаименованиеДОП;
			Движение.Операция = Перечисления.ОперацииУслуг.Зачисление;
			Движение.ДатаЗачисленияОтчисления = Дата;
		КонецЦикла;
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ)
		Если ЭтотОбъект.ЭтоДополнительноеСоглашение = Истина Тогда
			Если Не ЗначениеЗаполнено(ЭтотОбъект.СвязанныйДоговор) Тогда
				Отказ = Истина;
				Сообщить("Для дополнительного соглашения должен быть указан связанный договор");
			ИначеЕсли ЭтотОбъект.ФИОРебенка <> ЭтотОбъект.СвязанныйДоговор.ФИОРебенка Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru = 'Ребенок в договоре и дополнительном соглашении должен совпадать'");
			КонецЕсли;
		КонецЕсли;
		Если ЭтотОбъект.ТабДок.Количество() = 0 Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Укажите хотя бы одну ДОП.'");
			Сообщение.Сообщить();
		КонецЕсли;		
	КонецПроцедуры
	#КонецОбласти	
#КонецЕсли  

